class_name 윷짝

const 결과문자변환 = {
	-3:"뒷걸",
	-2:"뒷개",
	-1:"뒷도",
	0: "낙",
	1:"도",
	2:"개",
	3:"걸",
	4:"윷",
	5:"모",
}

var 결과수치 :int

func _to_string() -> String:
	return 결과문자변환[결과수치]

func 윷던지기() -> void:
	var 결과 :Array[int]
	for i in 4:
		결과.append( randi_range(0,1) )
	결과수치 = 결과해석(결과)

func 결과얻기() -> int:
	return 결과수치

func 결과해석(결과 :Array[int]) -> int:
	return result_to_val[결과]

const result_to_val :Dictionary = {
	# 0:등 1:배
	[0,0,0,1] : -1, # 도 백
	[0,0,1,0] : 1, # 도
	[0,1,0,0] : 1, # 도
	[1,0,0,0] : 1, # 도
	[0,0,1,1] : -2, # 개 백
	[0,1,0,1] : 2, # 개
	[1,0,0,1] : 2, # 개
	[0,1,1,0] : 2, # 개
	[1,0,1,0] : 2, # 개
	[1,1,0,0] : 2, # 개
	[0,1,1,1] : -3, # 걸 백
	[1,0,1,1] : 3, # 걸
	[1,1,0,1] : 3, # 걸
	[1,1,1,0] : 3, # 걸
	[1,1,1,1] : 4, # 윷
	[0,0,0,0] : 5, # 모
}

func 한번더던지나() -> bool:
	return 결과수치==5 or 결과수치 == 4
